%这个代码跑下来会发生异常，原因可能是Relu函数的敏感性造成的%

X =zeros(5,5,5);
D = eye(5);
N = 5;
%设置随机序列%
rng(3);
W1 = 2*rand(20,25)-1;
W2 = 2*rand(20,20)-1;
W3 = 2*rand(20,20)-1;
W4 = 2*rand(5,20)-1;
X(:,:,1)=[ 0 0 1 1 0;
           0 0 1 1 0;
           0 1 0 1 0;
           0 0 0 1 0;
           0 1 1 1 0];
X(:,:,2)=[ 1 1 1 1 0;
           0 0 0 0 1;
           0 1 1 1 0;
           1 0 0 0 1;
           1 1 1 1 1];
X(:,:,3)=[ 1 1 1 1 0;
           0 0 0 0 1;
           0 1 1 1 0;
           0 0 0 1 0;
           0 1 1 1 0];
X(:,:,4)=[ 0 1 1 1 0;
           0 1 0 0 0;
           0 1 1 1 0;
           0 0 0 1 0;
           0 1 1 1 0];
X(:,:,5)=[ 0 1 1 1 1;
           0 1 0 0 0;
           0 1 1 1 0;
           0 0 0 1 0;
           1 1 1 1 0];
for epoch =1:10000
   [W1,W2,W3,W4] = DeepRelu(W1,W2,W3,W4,D,X); 
end
for k =1:N
    x = reshape(X(:,:,k),25,1);
    v1 = W1*x;
    y1 = Relu(v1);
    v2 = W2*y1;
    y2 = Relu(v2);
    v3 = W3*y2;
    y3 = Relu(v3);
    v = W4*y3;
    y = Softmax(v);
    disp(y);
end
       